//=============================================================================
//【 EventFlag 】
//=============================================================================

//-------------------------------------------------------------------------
//
//-------------------------------------------------------------------------
#include "stdafx.h"
#include "EventFlag.h"

//-------------------------------------------------------------------------
//
//-------------------------------------------------------------------------
namespace LNote
{
namespace Core
{
namespace Thread
{

//=============================================================================
// ■ EventFlag クラス (Windows)
//=============================================================================
#if defined(LNOTE_WINDOWS)

    //---------------------------------------------------------------------
    //
    //---------------------------------------------------------------------
    EventFlag::EventFlag()
    	: mHandle( NULL )
    {
        mHandle = CreateEvent( NULL, TRUE, FALSE, NULL );
        ::InitializeCriticalSection( &mCS );
    }

    //---------------------------------------------------------------------
    // ● コンストラクタ
    //---------------------------------------------------------------------
    EventFlag::EventFlag( bool init_flag_ )
    	: mHandle( NULL )
    {
        BOOL t = ( init_flag_ ) ? TRUE : FALSE;
        // 手動リセットで作成
        mHandle = CreateEvent( NULL, TRUE, t, NULL );

        ::InitializeCriticalSection( &mCS );
       
    }

    //---------------------------------------------------------------------
    // ● デストラクタ
    //---------------------------------------------------------------------
    EventFlag::~EventFlag()
    {
         ::DeleteCriticalSection( &mCS );
        if ( mHandle )
        {
            ::CloseHandle( mHandle );
            mHandle = NULL;
        }
    }

    //---------------------------------------------------------------------
    // ● 値を true にする
    //---------------------------------------------------------------------
    void EventFlag::setTrue()
    {
        if ( mHandle )
        {
            ::SetEvent( mHandle );
        }
    }

    //---------------------------------------------------------------------
    // ● 値を false にする
    //---------------------------------------------------------------------
    void EventFlag::setFalse()
    {
        if ( mHandle )
        {
            ::ResetEvent( mHandle );
        }
    }

    //---------------------------------------------------------------------
    // ● 値が true かを判定する
    //---------------------------------------------------------------------
    bool EventFlag::isTrue()
    {
        if ( mHandle )
        {
            return ( ::WaitForSingleObject( mHandle, 0 ) == WAIT_OBJECT_0 );
        }
        return true;
    }

    //---------------------------------------------------------------------
    // ● true になるまで待機する
    //---------------------------------------------------------------------
    void EventFlag::wait()
    {
        if ( mHandle )
        {
#if LNOTE_ENABLE_THREAD_DEBUG
			if (::WaitForSingleObject( mHandle, 10000 ) != WAIT_OBJECT_0)
			{
				printf("EventFlag::wait() timeout");
				*reinterpret_cast< int* >( 0 ) = 0;
			}
#else
			::WaitForSingleObject( mHandle, INFINITE );
#endif
        }
    }
    
//=============================================================================
// ■ EventFlag クラス (pthread)
//=============================================================================
#else
    //---------------------------------------------------------------------
    // ● コンストラクタ
    //---------------------------------------------------------------------
    EventFlag::EventFlag( bool init_flag_ )
    {
        pthread_mutex_init( &mMutex, NULL );
        pthread_cond_init( &mWait, NULL );
        mSignal = init_flag_;
    }

    //---------------------------------------------------------------------
    // ● デストラクタ
    //---------------------------------------------------------------------
    EventFlag::~EventFlag()
    {
        pthread_cond_destroy( &mWait );
        pthread_mutex_destroy( &mMutex );
    }

    //---------------------------------------------------------------------
    // ● 値を true にする
    //---------------------------------------------------------------------
    void EventFlag::setTrue()
    {
        // ミューテックスをロックする
        int r = pthread_mutex_lock( &mMutex );
        if ( r != 0 )
        { 
        	errno = r; 
        	return;
        }
        
        mSignal = true;
        
        // 中断しているスレッドに通知を送る
        r = pthread_cond_broadcast( &mWait );//pthread_cond_signal( &mWait );
        if ( r != 0 )
        { 
        	errno = r; 
	        return;
        }
     
        // ミューテックスをアンロックする
        r = pthread_mutex_unlock( &mMutex );
        if ( r != 0 )
        { 
        	errno = r; 
	        return;
        }
    }

    //---------------------------------------------------------------------
    // ● 値を false にする
    //---------------------------------------------------------------------
    void EventFlag::setFalse()
    {
        pthread_mutex_lock( &mMutex );
        mSignal = false;
        pthread_mutex_unlock( &mMutex );
    }

    //---------------------------------------------------------------------
    // ● 値が true かを判定する
    //---------------------------------------------------------------------
    bool EventFlag::isTrue()
    {
        pthread_mutex_lock( &mMutex );
        bool b = mSignal;
        pthread_mutex_unlock( &mMutex );
        return b;
    }

    //---------------------------------------------------------------------
    // ● true になるまで待機する
    //---------------------------------------------------------------------
    void EventFlag::wait()
    {
        // ミューテックスをロックする
        int r = pthread_mutex_lock( &mMutex );
        if ( r != 0 ) { 
	errno = r; 
	return; }
        
        // true ならアンロックして中断してみる
        if ( mSignal )
        {
            pthread_mutex_unlock( &mMutex );
            return;
        }
        
        // スレッドをスリープさせる
        r = pthread_cond_wait( &mWait, &mMutex );
        if ( r != 0 ) { 
        	errno = r; 
	return; }
        
        // アンロック
        pthread_mutex_unlock( &mMutex );
        if ( r != 0 ) { 
        	errno = r; 
	return; }
    }
#endif

//-------------------------------------------------------------------------
//
//-------------------------------------------------------------------------

} // namespace Thread
} // namespace Core
} // namespace LNote

//=============================================================================
//								end of file
//=============================================================================