//=============================================================================
//【 AndroidFontManager 】
//-----------------------------------------------------------------------------
///**
//  @file       AndroidFontManager.h
//  @brief      AndroidFontManager
//  @author     Riki
//*/
//=============================================================================

#pragma once

//-------------------------------------------------------------------------
//
//-------------------------------------------------------------------------
#include "../FontManagerBase.h"

//-------------------------------------------------------------------------
//
//-------------------------------------------------------------------------
namespace LNote
{
namespace Core
{
namespace File { class Manager; }
    
namespace Graphics
{
namespace Android
{
class AndroidFont;

//=============================================================================
// ■ AndroidFontManager クラス
//-----------------------------------------------------------------------------
///**
//  @brief     フォントの管理クラス
//*/
//=============================================================================
class AndroidFontManager
    : public FontManagerBase
{
public:

    /// コンストラクタ
    AndroidFontManager();

public:

    /// 初期化
    void initialize( File::Manager* file_manager_ );

    /// フォントファイルを追加する (ttf)
    virtual void addFontFile( const lnChar* fontname_ );

    /// フォント作成
    virtual IFont* createFont();

private:

    File::Manager*  mFileManager;
};

//-------------------------------------------------------------------------
//
//-------------------------------------------------------------------------

} // namespace Android
} // namespace Graphics
} // namespace Core
} // namespace LNote

//=============================================================================
//								end of file
//=============================================================================