//=============================================================================
//【 リファレンス 】
//-----------------------------------------------------------------------------
/**
    @page references1 リファレンス

    - @ref references1_anchor1 "HSP (Hot Soup Processor)"<br>
    <br>
    
    @if DOXY_COMMENT --------------------------------------------------- @endif
    @anchor references1_anchor1
    <hr>
    @par HSP (Hot Soup Processor)
    <br>
    @if DOXY_COMMENT --------------------------------------------------- @endif
    @ref install1_anchor1 "導入方法と使い方" を参考に "lnote.hs" をコピーし、F1 ヘルプをご覧ください。
    <br>
    <br>
*/
//=============================================================================