//=============================================================================
//【 LFramework 】
//-----------------------------------------------------------------------------
///**
//  @file       LFramework.h
//  @brief      LFramework
//  @version    1.0
//  @date       2010/09/10
//*/
//=============================================================================

#pragma once

//-------------------------------------------------------------------------
//
//-------------------------------------------------------------------------
#include "../Base/LRefClass.h"
#include "../Game/LGameScene.h"

//-------------------------------------------------------------------------
//
//-------------------------------------------------------------------------
namespace LNote
{

//=============================================================================
// ■ LFramework クラス
//-----------------------------------------------------------------------------
///**
//  @brief      ライブラリ全体の動作を管理するクラス
//
//  @par
//              このクラスのインスタンスには、
//              グローバル変数 LNote::Accessor::Framework によってもアクセスできます。
//*/
//=============================================================================
class LFramework
    : public LSingletonRefClass< LFramework, Core::Framework >
{
public:

    //---------------------------------------------------------------------
    ///**
    //  @brief      インスタンスの取得
    //*/
	//---------------------------------------------------------------------
	static LFramework getInstance();

public:

    //---------------------------------------------------------------------
    ///**
    //  @brief      フレーム更新回数の取得
    //*/
	//---------------------------------------------------------------------
    u32 getFrameCount() const;

    //---------------------------------------------------------------------
    ///**
    //  @brief      ゲームタイムの取得
    //*/
	//---------------------------------------------------------------------
    LGameTime getGameTime() const;

    //---------------------------------------------------------------------
    ///**
    //  @brief      ゲームタイムの取得
    //*/
	//---------------------------------------------------------------------
    void reset() const;

    //---------------------------------------------------------------------
    ///**
    //  @brief      update() で行う処理を指定する
    //
    //  @param[in]  flags_ : LNAutoUpdateFlags のフラグの組み合わせ
    //
    //  @par
    //              LN_AUTOUPDATE_SYSTEM を指定しなかった場合、
    //              Framework はアプリケーションに終了要求(ウィンドウの×ボタンがクリックされた等)
    //              が来ているかを判定できなくなります。<br>
    //              この場合 update() は常に true を返します。<br>
    //              <br>
    //              LN_AUTOUPDATE_SYSTEM    : メッセージ処理とフレーム待ち処理を行う (常に ON を推奨)<br>
	//              LN_AUTOUPDATE_INPUT     : 入力機能の更新を行う<br>
	//              LN_AUTOUPDATE_AUDIO     : 音声機能の更新を行う<br>
	//              LN_AUTOUPDATE_SCENE     : ゲーム画面の描画を行う<br>
    //*/
	//---------------------------------------------------------------------
    //void setAutoUpdateFlags( u32 flags_ );

    //---------------------------------------------------------------------	
    ///**
    //  @brief      フレーム更新
    //
    //  @par
    //              ライブラリ全体を 1 フレーム分更新します。
    //              通常、1 フレームに 1 度だけ呼び出します。<br>
    //
    //  @attention
    //              run() によってゲームシーンを実行している場合、更新処理は
    //              LGameScene クラスの内部で行われます。
    //              その場合は不具合防止のため、この関数は何も行わずに常に
    //              true を返すようになります。
    //*/
	//---------------------------------------------------------------------
	bool update();

    //---------------------------------------------------------------------
    ///**
    //  @brief      登録されているゲームシーンを指定して実行開始
    //*/
	//---------------------------------------------------------------------
    void run( const lnChar* scene_name_ );

    //---------------------------------------------------------------------
    ///**
    //  @brief      ゲームシーンを与えて実行開始
    //
    //  @par
    //              この関数は、アプリケーションに終了要求が来る(ウィンドウの
    //              クローズボタンが押される等)か、exit() が呼ばれるまで
    //              終了せず、内部でゲームのメインループを実行し続けます。<br>
    //              <br>
    //              この関数で実行を開始した場合、以降の更新処理は LGameScene
    //              クラスの内部で行われます。そのため、update() を呼び出す必要は
    //              ありません。
    //*/
	//---------------------------------------------------------------------
    void run( LGameScene* scene_ );

    

    //---------------------------------------------------------------------
    ///**
    //  @brief      ゲームシーンを実行中かどうかを判定する
    //*/
	//---------------------------------------------------------------------
    bool isRunning() const;

    //---------------------------------------------------------------------
    ///**
    //  @brief      ライブラリに終了を要求する
    //
    //  @par
    //              プログラム内からライブラリに終了を伝えたい場合に使います。
    //              以降は update() が常に false を返すようになり、更新処理は
    //              一切行われなくなります。<br>
    //              run() が実行中の場合は実行を中断し、関数を終了します。
    //*/
	//---------------------------------------------------------------------
    void exit();


    //---------------------------------------------------------------------
    ///**
    //  @brief      ゲームシーンのインスタンスを登録する
    //
    //  @par
    //              この関数は registerSceneInstance( new TestScene(), "TestScene" ); のような形で
    //              new したポインタを直接渡すことを想定しています。
    //              そのため、渡されたポインタは SceneManage で管理され、
    //              ゲームシーンが必要なくなった時点で release() が
    //              呼ばれます。
    //  @attention
    //              ちょっと使い方を間違えるとメモリリークの原因になるので、
    //              基本的には registerSceneInstance< TYPE_ >() を使ってください。
    //*/
    //---------------------------------------------------------------------
    void registerSceneInstance( LGameScene* scene_ );

    //---------------------------------------------------------------------
    ///**
    //  @brief      ゲームシーンの型を指定してインスタンスを登録する
    //
    //  @par
    //              この関数はポインタを隠蔽するための registerSceneInstance() です。
    //              registerSceneInstance< TestScene >( "TestScene" ); という形で呼び出します。
    //*/
    //---------------------------------------------------------------------
    template < typename TYPE_ > void registerSceneInstance()       { TYPE_* t = NEW TYPE_; registerSceneInstance( t ); }

};

//-------------------------------------------------------------------------
//
//-------------------------------------------------------------------------

} // namespace LNote

//=============================================================================
//                              end of file
//=============================================================================