//=============================================================================
//【 LKeyboard 】
//-----------------------------------------------------------------------------
///**
//  @file       LKeyboard.h
//  @brief      LKeyboard
//  @version    1.0
//  @date       2011/08/22
//*/
//=============================================================================

#pragma once

//-------------------------------------------------------------------------
//
//-------------------------------------------------------------------------
#include "../../Core/Input/Keyboard.h"

//-------------------------------------------------------------------------
//
//-------------------------------------------------------------------------
namespace LNote
{

//=============================================================================
// ■ LKeyboard クラス
//-----------------------------------------------------------------------------
//**
//  @brief      Input::Keyboard の参照クラス
//
//  @par
//              このクラスのインスタンスにアクセスるためには、
//              グローバル変数 LNote::Accessor::Keyboard を使うか、
//              LInput::getKeyboard() によってインスタンスを取得する必要があります。
//*/
//=============================================================================
class LKeyboard
    : public LRefClass< LKeyboard, Core::Input::IKeyboard >
{
public:
	
	/// キーが現在押されているかを判定する
	bool isPress( LNVirtualKeyCode vkey_ ) const;

	/// キーが新しく押された瞬間を判定する
	bool isOnTrigger( LNVirtualKeyCode vkey_ ) const;

	/// キーが離された瞬間を判定する
	bool isOffTrigger( LNVirtualKeyCode vkey_ ) const;

	/// キーが新しく押され瞬間とリピート状態を判定する
	bool isRepeat( LNVirtualKeyCode vkey_ ) const;

    LN_UTIL_REFCLASS_METHODS( LKeyboard, Core::Input::IKeyboard );
};

//-------------------------------------------------------------------------
//
//-------------------------------------------------------------------------

} // namespace LNote

//=============================================================================
//								end of file
//=============================================================================