//=============================================================================
//【 LKeyboard 】
//=============================================================================

//-------------------------------------------------------------------------
//
//-------------------------------------------------------------------------
#include "stdafx.h"
#include "../UtilCommon.h"
#include "LKeyboard.h"

//-------------------------------------------------------------------------
//
//-------------------------------------------------------------------------
namespace LNote
{

//=============================================================================
// ■ LKeyboard クラス
//=============================================================================

	// ボタンが現在押されているかを判定する
	bool LKeyboard::isPress( LNVirtualKeyCode vkey_ ) const
	{
		return _impl->isPress( vkey_ );
	}

	// ボタンが新しく押されたかを判定する
	bool LKeyboard::isOnTrigger( LNVirtualKeyCode vkey_ ) const
	{
		return _impl->isOnTrigger( vkey_ );
	}

	// ボタンが離されたかを判定する
	bool LKeyboard::isOffTrigger( LNVirtualKeyCode vkey_ ) const
	{
		return _impl->isOffTrigger( vkey_ );
	}

	// ボタンが新しく押された & リピート状態を判定する
	bool LKeyboard::isRepeat( LNVirtualKeyCode vkey_ ) const
	{
		return _impl->isRepeat( vkey_ );
	}

//-------------------------------------------------------------------------
//
//-------------------------------------------------------------------------

} // namespace LNote

//=============================================================================
//								end of file
//=============================================================================