//=============================================================================
//【 LMouse 】
//-----------------------------------------------------------------------------
///**
//  @file       LMouse.h
//  @brief      LMouse
//  @version    1.0
//  @date       2011/08/22
//*/
//=============================================================================

#pragma once

//-------------------------------------------------------------------------
//
//-------------------------------------------------------------------------
#include "../../Core/Input/Mouse.h"
#include "../Math/LMath.h"

//-------------------------------------------------------------------------
//
//-------------------------------------------------------------------------
namespace LNote
{

//=============================================================================
// ■ LMouse クラス
//-----------------------------------------------------------------------------
///**
//  @brief      Input::Mouse の参照クラス
// 
//  @par
//              このクラスのインスタンスにアクセスるためには、
//              グローバル変数 LNote::Accessor::Mouse を使うか、
//              LInput::getMouse() によってインスタンスを取得する必要があります。
//*/
//=============================================================================
class LMouse
    : public LRefClass< LMouse, Core::Input::IMouse >
{
public:

	/// ボタンが現在押されているかを判定する
	bool isPress( LNMouseButton button_ ) const;

	/// ボタンが新しく押された瞬間を判定する
	bool isOnTrigger( LNMouseButton button_ ) const;

	/// ボタンが離された瞬間を判定する
	bool isOffTrigger( LNMouseButton button_ ) const;

	/// ボタンが新しく押された瞬間とリピート状態を判定する
	bool isRepeat( LNMouseButton button_ ) const;

    //---------------------------------------------------------------------
    ///**
    //  @brief      マウス座標の取得
    //
    //  @par
    //              座標はクライアント領域の左上を原点 ( 0, 0 ) とした値です。
    //*/
    //---------------------------------------------------------------------
	LVector2 getPoint() const;

	//---------------------------------------------------------------------
    ///**
    //  @brief      1 フレーム前からの移動量の取得
    //*/
    //---------------------------------------------------------------------
	LVector2 getDistance() const;

	//---------------------------------------------------------------------
    ///**
    //  @brief      1 フレームのホイールの回転量の取得
    //
    //  @return     正の値は前(奥)、負の値は後ろ(手前)へ回された事を意味します。
    //              windows では通常 回した回数 * WHEEL_DELTA の値ですが、
    //              この関数は回した回数を返します。
    //*/
    //---------------------------------------------------------------------
	int getWheelState() const;

	//---------------------------------------------------------------------
    ///**
    //  @brief      マウスカーソルの挙動の設定
    //
    //  @par        
    //              マウスカーソルがウィンドウ上にあるときに表示しないようにする等、
    //              アイコン表示と動作の設定を行います。
    //*/
    //---------------------------------------------------------------------
	//void setCursorMode( LNMouseCursorMode mode_ );

    LN_UTIL_REFCLASS_METHODS( LMouse, Core::Input::IMouse );
};

//-------------------------------------------------------------------------
//
//-------------------------------------------------------------------------

} // namespace LNote

//=============================================================================
//								end of file
//=============================================================================