//=============================================================================
//【 ModelIK 】
//-----------------------------------------------------------------------------
///**
//  @file       ModelIK.h
//  @brief      ModelIK
//  @author     Riki
//*/
//=============================================================================

#pragma once

//-------------------------------------------------------------------------
//
//-------------------------------------------------------------------------
#include "../../../Base/RefString.h"
#include "PMDTypes.h"

//-------------------------------------------------------------------------
//
//-------------------------------------------------------------------------
namespace Lumine
{
namespace Graphics
{

//=============================================================================
// ■ ModelIK クラス
//-----------------------------------------------------------------------------
///**
//  @brief
//
//  @note
//              IK データは共有して使われる。
//              そのため、IK ターゲットボーンはポインタではなくインデックスで持っておく。
//*/
//=============================================================================
class ModelIK
{
public:

    ModelIK();

    virtual ~ModelIK();

public:

    /// 初期化
    void initializePMD( ModelCore* model_core_, const PMD_IK* ik_data_ );

    /// 適用 (モーション適用後、ボーンのワールド行列が階層更新された後に呼ぶ)
    void update( ModelFrame* frames_ );

    /// ModelCore 内の比較関数から呼ばれる
    inline short getSortVal() { return mSortVal; }

private:

    /// 解放
    void _release();

    /// ボーンの回転角度を制限する
    void _limitAngle( LQuaternion* pvec_out_, const LQuaternion& pvec_src_ );

private:

    ModelCore*  mModelCore;

    lnU32       mTargetBoneIdx;	///< IKターゲットボーン
    lnU32       mEffBoneIdx;	///< IK先端ボーン (エフェクタ)

    lnU16	    mCalcCount;     ///< 再帰演算回数
    float       mFact;          ///< IK 影響度
    short		mSortVal;       ///< IK データソート用の基準値

    lnU8	    mLinkNum;	    ///< IKを構成するボーンの数
    lnU32*		mBoneIndexList; ///< IKを構成するボーン番号の配列 Child

};

//-------------------------------------------------------------------------
//
//-------------------------------------------------------------------------

} // namespace Graphics
} // namespace Lumine

//=============================================================================
//								end of file
//=============================================================================