//=============================================================================
//【 SystemUtil 】
//-----------------------------------------------------------------------------
///**
//  @file       SystemUtil.h
//  @brief      SystemUtil
//  @author     Riki
//*/
//=============================================================================

#pragma once

//-------------------------------------------------------------------------
//
//-------------------------------------------------------------------------
#include "../Interface.h"

//-------------------------------------------------------------------------
//
//-------------------------------------------------------------------------
namespace LNote
{
namespace Core
{
namespace System
{




namespace Win32
{

/// メッセージをライブラリ用のイベントメッセージに変換する
LRESULT translateMessageToLN( Event** lnev_, HWND hwnd_, UINT msg_, WPARAM wparam_, LPARAM lparam_, bool* handled_ );

/// ライブラリで必要なメッセージかをチェックする
bool checkNecessaryMessage( UINT msg_ );

//---------------------------------------------------------------------
///**
//  @brief      VK_～ → LN_KEY_～ へのキーコード変換
//
//  @par
//              使っていく中で、LNVirtualKeyCode のように直で変換できない
//              ものがあった場合はここに書いていく
//*/	
//---------------------------------------------------------------------
LNVirtualKeyCode convertVirtualKeyCode( u32 win_vk_ );

} // namespace Win32

//-------------------------------------------------------------------------
//
//-------------------------------------------------------------------------

} // namespace System
} // namespace Core
} // namespace LNote

//=============================================================================
//                              end of file
//=============================================================================