//=============================================================================
//【 GUIDesktop 】
//-----------------------------------------------------------------------------
///**
//  @file       GUIDesktop.h
//  @brief      GUIDesktop
//  @author     Riki
//*/
//=============================================================================

#pragma once

//-------------------------------------------------------------------------
//
//-------------------------------------------------------------------------
#include "../Common.h"
#include "GUIControl.h"

//-------------------------------------------------------------------------
//
//-------------------------------------------------------------------------
namespace LNote
{
namespace Core
{
namespace GUI
{

//=============================================================================
// ■ GUIDesktop
//-----------------------------------------------------------------------------
///**
//  @brief      
//*/
//=============================================================================
class GUIDesktop
    : public GUIControl
{
public:

    GUIDesktop( Manager* manager_ );

public:

    /// 初期化
    void initialize();

    /// (Scene::Pane と関連付けられている場合、Pane::update() から呼ばれる)
    virtual void updateCoordinate( const LRect& parent_client_rect_ );

    /// (Scene::Pane と関連付けられている場合、Pane::updateContext() から呼ばれる)
    virtual void updateDrawContents() { GUIControl::updateDrawContents(); }

    /// (Scene::Pane と関連付けられている場合、PaneContext::draw() から呼ばれる)
    virtual void draw();

public:

    LSize   mTargetViewSize;
};

//-------------------------------------------------------------------------
//
//-------------------------------------------------------------------------

} // namespace GUI
} // namespace Core
} // namespace LNote

//=============================================================================
//                              end of file
//=============================================================================