//=============================================================================
//【 Effect 】
//-----------------------------------------------------------------------------
///**
//  @file       Effect.h
//  @brief      Effect
//  @author     Riki
//*/
//=============================================================================

#pragma once

//-------------------------------------------------------------------------
//
//-------------------------------------------------------------------------
#include "../../Effect/Core/EffectCore.h"
#include "../../Effect/Instance/EffectInstance.h"
#include "SceneNode.h"

//-------------------------------------------------------------------------
//
//-------------------------------------------------------------------------
namespace LNote
{
namespace Core
{
namespace Scene
{

//=============================================================================
// ■ Effect クラス
//-----------------------------------------------------------------------------
///**
//  @brief		エフェクト
//*/
//=============================================================================
class Effect
    : public SceneNode
{
public:

    /// コンストラクタ
    Effect( SceneGraph* scene_ );

    /// デストラクタ
    virtual ~Effect();

public:

    /// 初期化(エディタ用)
    void initialize( Core::Effect::EffectCore* core_ );

public:

    /// ノードの種類の取得
    virtual LNSceneNodeType getSceneNodeType() const { return LN_SCENENODE_GRID; }

    /// フレーム更新
    virtual void update( const Game::GameTime& time_ );

    /// サブセットを描画する
    virtual LNRESULT drawSubset( lnU32 index_ );

private:

    Core::Effect::EffectInstance* mEffect;
    
};

//-------------------------------------------------------------------------
//
//-------------------------------------------------------------------------

} // namespace Scene
} // namespace Core
} // namespace LNote

//=============================================================================
//                              end of file
//=============================================================================