//=============================================================================
//【 Util 】
//-----------------------------------------------------------------------------
///**
//  @file       Util.h
//  @brief      Util
//  @author     Riki
//*/
//=============================================================================

#pragma once

//-------------------------------------------------------------------------
//
//-------------------------------------------------------------------------

//-------------------------------------------------------------------------
//
//-------------------------------------------------------------------------
namespace LNote
{
namespace Core
{
namespace Scene
{

//=============================================================================
// ■ Util クラス
//-----------------------------------------------------------------------------
///**
//  @brief		
//*/
//=============================================================================
class Util
{
public:

    /// ピクセル単位の転送矩形をテクスチャUVの矩形 (0.0～1.0) に変換する
    static void normalizeSrcRect(
        lnfloat* l_, lnfloat* t_, lnfloat* r_, lnfloat* b_,
        const Geometry::Rect& rect_, const LVector2& tex_size_ )
    {
        lnfloat x = static_cast< lnfloat >( rect_.x );
        lnfloat y = static_cast< lnfloat >( rect_.y );
        lnfloat w = static_cast< lnfloat >( rect_.w );
        lnfloat h = static_cast< lnfloat >( rect_.h );
        lnfloat tex_rw = 1.f / tex_size_.x;
        lnfloat tex_rh = 1.f / tex_size_.y;

        *l_ = x * tex_rw;
        *t_ = y * tex_rh;
        *r_ = ( x + w ) * tex_rw;
        *b_ = ( y + h ) * tex_rh;

#if 0 // 以下でないと計算誤差が出るが、実際見てみるとほとんど変わらなかったのでとりあえず上のまま
        lnfloat tex_rw = 1.f / tex_size_.x;
        lnfloat tex_rh = 1.f / tex_size_.y;

        *l_ = x / tex_size_.x;
        *t_ = y / tex_size_.y;
        *r_ = ( x + w ) / tex_size_.x;
        *b_ = ( y + h ) / tex_size_.y;
#endif
    }
};

//-------------------------------------------------------------------------
//
//-------------------------------------------------------------------------

} // namespace Scene
} // namespace Core
} // namespace LNote

//=============================================================================
//								end of file
//=============================================================================